# Homebrew bundle — run `brew bundle` to install everything.
# Generated for macOS Apple Silicon.

# ============================================================
# Symlink + bootstrap helpers
# ============================================================
brew "stow"

# ============================================================
# Core git tooling
# ============================================================
brew "git"
brew "git-delta"        # pretty git diff pager
brew "difftastic"       # AST-aware semantic diff
brew "gh"               # GitHub CLI
brew "lazygit"          # TUI git client

# ============================================================
# Terminal multiplexer + shell prompt
# ============================================================
brew "tmux"
brew "starship"

# ============================================================
# Shell quality of life
# ============================================================
brew "fzf"              # fuzzy finder
brew "zoxide"           # smart cd
brew "atuin"            # shell history with fuzzy search
brew "eza"              # modern ls
brew "bat"              # cat with syntax highlighting
brew "fd"               # modern find
brew "ripgrep"          # fast grep
brew "jq"               # JSON processor
brew "wget"
brew "btop"             # process viewer

# ============================================================
# Editor + Neovim deps
# ============================================================
brew "neovim"
brew "tree-sitter"
brew "tree-sitter-cli"

# ============================================================
# File manager + media preview deps
# ============================================================
brew "yazi"
brew "ffmpeg"           # video thumbnails for yazi
brew "poppler"          # PDF previews for yazi
brew "sevenzip"         # archive browsing for yazi

# ============================================================
# Casks
# ============================================================
cask "ghostty"                          # terminal emulator
cask "font-jetbrains-mono-nerd-font"    # required for icons in eza, starship, tmux

# ============================================================
# Optional — install yourself if you want these
# ============================================================
# tap "max-sixty/worktrunk"
# brew "worktrunk"                      # git worktree manager
# brew "gh-dash" (install as gh extension: `gh extension install dlvhdr/gh-dash`)
